src/cf/Catalogs/ШаблоныПечатиОфисныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныПечатиОфисныхДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияШаблоновПечатиОфисныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыделятьПоляДокументаЦветом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_ОбъектПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлШаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвойстваПараметровШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ШаблоныПечатиОфисныхДокументов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредложитьЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов.Значение КАК ДоговорыКонтрагентов,
	|	ПредложитьЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения.Значение КАК КоммерческиеПредложения
	|ИЗ
	|	Константа.ПредложитьЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов КАК
	|		ПредложитьЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов,
	|	Константа.ПредложитьЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения КАК
	|		ПредложитьЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения";

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СписокЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов", "Видимость", Выборка.ДоговорыКонтрагентов);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СписокЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения", "Видимость", Выборка.КоммерческиеПредложения);

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Назначение") Тогда
		Назначение = Параметры.Отбор.Назначение;
	КонецЕсли;

	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Когда появятся новые шаблоны?'");
	ПараметрыВажногоСообщения.Сообщение = НСтр(
		"ru = 'Новые шаблоны появятся в командах печати после перезапуска соответствующих форм (например, список Заказов покупателей)'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;

	СтандартныеПодсистемыСервер.ПереместитьЭлементыВГруппу(Элементы.Список.КоманднаяПанель, Элементы.ФормаКоманднаяПанель);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Назначение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Назначение", Назначение,
			ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Назначение");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСнятьПометкуИспользуется(Команда)

	Если Элементы.Список.ПолучитьСтрокиДляОбработки().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Шаблоны = Элементы.Список.ПолучитьСтрокиДляОбработки();
	ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны);

	ОповеститьОбИзменении(Элементы.Список.ТекущиеДанные.Ссылка);
	ПараметрыОповещения = Новый Структура("ЭтоНовый,Назначение", Истина, Элементы.Список.ТекущиеДанные.Назначение);
	Оповестить("Запись_ШаблоныПечатиОфисныхДокументов", ПараметрыОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов(Команда)

	ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентовНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументов"));

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения(Команда)

	ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложенияНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументов"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны)

	Для Каждого ШаблонСсылка Из Шаблоны Цикл
		ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
		ШаблонОбъект.Используется = Не ШаблонОбъект.Используется;
		ШаблонОбъект.Записать();
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентовНаСервере()

	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныДоговоровКонтрагентов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложенияНаСервере()

	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныКоммерческогоПредложения();

КонецПроцедуры

#КонецОбласти
